$ swipl tree_search.pl breadth_first.pl test1.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 7.5.15)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- search([[a]], X).
X = [a, f, i] ;
false.

?- ^D
% halt

$ swipl tree_search.pl breadth_first.pl test2.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 7.5.15)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- search([[a]], X).
X = [a, b, d] ;
X = [a, f, i] ;
X = [a, f, i, j, m] ;
false.

?- ^D
% halt
